packages/inductiva/inductiva-0.3.8.tar.gz/inductiva-0.3.8/inductiva/templates/heat_sink/openfoam/sim_config_files/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/parameters"

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 $airVelocity);

boundaryField
{

    inlet_fluid
    {
        type            fixedValue;
        value           $internalField;
    }
    walls_fluid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet_fluid
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    fluid_to_fins
    {
        type            noSlip;
    }
}

// ************************************************************************* //
