packages/inductiva/inductiva-0.3.8.tar.gz/inductiva-0.3.8/inductiva/templates/heat_sink/openfoam/sim_config_files/system/volAvgHeaterTemperature
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the maximum cell value for one or more fields.

\*---------------------------------------------------------------------------*/


type            volFieldValue;
libs            ("libfieldFunctionObjects.so");
log             true;
//writeControl    timeStep;//writeTime;//timeStep;//writeTime;
writeFields     false;
regionType      all;//cellZone;
region          heater;
name            heater;
operation       volAverage;
weightField     none;//alpha1;
fields
(
    T
);

// ************************************************************************* //
